package com.company;

/*
Дана переменная number.
Напиши программу, которая выводит на экран квадрат этой переменной (number * number).
 */
public class Task0140 {
    public static int number = 25;

    public static void main(String[] args) {
        System.out.print(Math.pow(number, 2));    //напишите тут ваш код
    }
}