package com.company;

/*
Дана переменная number.
Напиши программу, которая выводит на экран квадрат этой переменной (number * number).
 */
public class Task0201 {
    public static void main(String[] args) {
        print("Java easy to learn!");
        print("Java opens many opportunities!");
    }

    public static void print(String s) {
     int i = 0;
        while (i<4) {
            System.out.println(s);
            i++; //напишите тут ваш код
        }
    }
}